# pandas

In [1]:
'''
240 page
'''

import pandas as pd
import os

In [2]:
print('현재 디렉토리(폴더) :', os.getcwd())

현재 디렉토리(폴더) : /Users/junhyun/Workspace/w3labkr.github.com/academy-tjoeun-data-analysis/day09

In [3]:
# csv 파일에 저장된 data로 DataFrame 객체를 생성함
score = pd.read_csv('../dataset/data/score.csv')
score.head()

    no  kor  eng  mat  dept
0  101   88   85   86   101
1  102   70   90   92   101
2  103   90   45   55   101
3  104   55   52   74   102
4  105   65   85   96   102

In [4]:
# 컬럼 추출하기 <-- DataFrame 에서 컬럼 하나만 추출함 <-- Series
kor = score.kor
eng = score.eng
mat = score.mat
dept = score.dept

In [5]:
kor.head()

0    88
1    70
2    90
3    55
4    65
Name: kor, dtype: int64

In [6]:
kor = score['kor']
eng = score['eng']
mat = score['mat']
dept = score['dept']

In [7]:
kor.head()

0    88
1    70
2    90
3    55
4    65
Name: kor, dtype: int64

In [8]:
score.describe()

               no        kor        eng        mat        dept
count   15.000000  15.000000  15.000000  15.000000   15.000000
mean   108.000000  71.400000  67.933333  71.333333  102.000000
std      4.472136  16.361104  15.957384  17.215718    0.845154
min    101.000000  40.000000  45.000000  41.000000  101.000000
25%    104.500000  59.000000  53.500000  59.000000  101.000000
50%    108.000000  75.000000  66.000000  75.000000  102.000000
75%    111.500000  85.000000  81.500000  85.000000  103.000000
max    115.000000  95.000000  90.000000  96.000000  103.000000

In [9]:
# 과목별 최고 점수
print('국어 최고 점수 :', max(kor))
print('영어 최고 점수 :', max(eng))
print('수학 최고 점수 :', max(mat))

국어 최고 점수 : 95
영어 최고 점수 : 90
수학 최고 점수 : 96

In [10]:
# 과목별 최저 점수
print('국어 최고 점수 :', min(kor))
print('영어 최고 점수 :', min(eng))
print('수학 최고 점수 :', min(mat))

국어 최고 점수 : 40
영어 최고 점수 : 45
수학 최고 점수 : 41

In [11]:
from statistics import mean

# 과목별 평균 점수
print('국어 최고 점수 :', mean(kor))
print('영어 최고 점수 :', mean(eng))
print('수학 최고 점수 :', mean(mat))

국어 최고 점수 : 71.4
영어 최고 점수 : 67.93333333333334
수학 최고 점수 : 71.33333333333333

In [12]:
# 과목별 평균 점수 : 소수점 셋째 자리까지만 출력하기
print('국어 최고 점수 :', round(mean(kor), 3))
print('영어 최고 점수 :', round(mean(eng), 3))
print('수학 최고 점수 :', round(mean(mat), 3))

국어 최고 점수 : 71.4
영어 최고 점수 : 67.933
수학 최고 점수 : 71.333

In [13]:
dept.head()

0    101
1    101
2    101
3    102
4    102
Name: dept, dtype: int64

In [14]:
# 학과별 인원수 파악히기 - dept 의  빈도수
# 비어있는 dictionary
dept_count = {}

for key in dept:
    dept_count[key] = dept_count.get(key, 0) + 1
    
dept_count

{101: 5, 102: 5, 103: 5}

In [15]:
'''
242 page
'''

import pandas as pd

In [16]:
# (1) 엑셀 파일 읽기
sam = pd.ExcelFile('../dataset/data/sam_kospi.xlsx')
sam

In [17]:
# (2) ExcelFile 객체를 DataFrame 객체로 변환하기
#     ExcelFile 클래스의 parse() 메소드를 호출함
kospi = sam.parse('sam_kospi')

print(type(kospi))
kospi.head()

<class 'pandas.core.frame.DataFrame'>

        Date     Open     High      Low    Close  Volume
0 2015-10-30  1345000  1390000  1341000  1372000  498776
1 2015-10-29  1330000  1392000  1324000  1325000  622336
2 2015-10-28  1294000  1308000  1291000  1308000  257374
3 2015-10-27  1282000  1299000  1281000  1298000  131144
4 2015-10-26  1298000  1298000  1272000  1292000  151996

In [18]:
kospi = pd.read_excel('../dataset/data/sam_kospi.xlsx')

print(type(kospi))
kospi.head()

<class 'pandas.core.frame.DataFrame'>

        Date     Open     High      Low    Close  Volume
0 2015-10-30  1345000  1390000  1341000  1372000  498776
1 2015-10-29  1330000  1392000  1324000  1325000  622336
2 2015-10-28  1294000  1308000  1291000  1308000  257374
3 2015-10-27  1282000  1299000  1281000  1298000  131144
4 2015-10-26  1298000  1298000  1272000  1292000  151996

In [19]:
kospi.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 247 entries, 0 to 246
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    247 non-null    datetime64[ns]
 1   Open    247 non-null    int64
 2   High    247 non-null    int64
 3   Low     247 non-null    int64
 4   Close   247 non-null    int64
 5   Volume  247 non-null    int64
dtypes: datetime64[ns](1), int64(5)
memory usage: 11.7 KB

In [20]:
# (3) 컬럼값 출력하기
high = kospi['High']
low = kospi['Low']

In [21]:
# 고가와 저가의 평균 금액 구하기
# statistics 모듈에 있는 mean() 함수 사용하기
from statistics import mean
print('고가 평균 금액 :', format(round(mean(high), 2), ','), '원')
print('저가 평균 금액 :', format(round(mean(low), 2), ','), '원')

고가 평균 금액 : 1,307,947.37 원
저가 평균 금액 : 1,280,919.03 원

In [22]:
# Series 객체에 있는 mean() 메소드 사용하기
print('고가 평균 금액 :', format(round(high.mean(), 2), ','), '원')
print('저가 평균 금액 :', format(round(low.mean(), 2), ','), '원')

고가 평균 금액 : 1,307,947.37 원
저가 평균 금액 : 1,280,919.03 원